{"id": 2, "subject": "Exciting Launch!!!", "content": "Hey Team, So, like, we’re launching the new product, right? I mean, it’s super cool and everyone will love it. But, um, I think we should have a meeting to discuss it, maybe next next Friday? Or was it this Friday? Anyway, let’s not forget to prepare the presentation, but also, we might need to change some things last minute. Also, the marketing team has some ideas, but they’re not sure if they’re good or not, you know? So, let’s just wing it? And remember, the launch is happening in the morning, or was it afternoon? I’ll send out a calendar invite, but it might be confusing, so just keep an eye out. Cheers!!!", "sender": "taylor.smith@tech.io"}
{"id": 3, "subject": "Bug Report - Urgent!!!", "content": "Hey Team, so like I was using the app and it was like super weird. I mean, I clicked on the button and then it just didn’t do anything, right? This happened on the next next Friday, or was it the Friday before that? Anyway, it was around 3 PM, I think, but could’ve been 4? Not sure. So, can someone look into this? It’s really important because it’s affecting my work, but also it’s not that big of a deal? Just letting you know. Thanks! P.S. The colors are also off, like why is the green not green? Let’s fix this ASAP, but no rush unless it’s a rush? Cheers!", "sender": "morgan.jones@corp.net"}
{"id": 5, "subject": "Exciting Product Launch!!!", "content": "Hey Team!!! So, like, we’re launching the new product, you know, the one we’ve been talking about for ages, like, next next Friday? Or was it this Friday? Anyway, it’s super important that we all, um, get on the same page. I think we should have a meeting, but not too early, maybe after lunch? Or was it before lunch? I’m not sure. Also, don’t forget to, like, tell everyone to wear their best shirts or whatever, because it’s a big deal, right? And, um, I heard the marketing team is doing some cool stuff, but I’m not sure what exactly. So, yeah, let’s just make sure we’re all ready for the launch, which is, um, sometime soon. Thanks!!!", "sender": "jordan.smith@tech.io"}
{"id": 1, "subject": "Re: Meeting Reschedule??", "content": "Hey team, so like, we need to talk about that meeting we had planned for next next Friday? Or was it the Friday after next? I'm not sure. Anyway, can we move it to some time that works for everyone? Maybe like 3 PM or was it 3 AM? 🤔 Also, I think we should include the new guy, but he might be busy with his other stuff? So, yeah, let me know what you all think. Thanks! Or should I say, no thanks? 😂", "sender": "morgan.williams@corp.net"}
{"id": 4, "subject": "Bug Report - Urgent Issue!!!", "content": "Hey Team, so like, I was using the app and then it just, you know, crashed? It was like, um, last week or maybe the week before? I think it was on a Friday, but not this Friday, maybe next next Friday? Anyway, the screen went all weird and I couldn't do anything. I tried restarting it, but it was still like, not working. Can someone look into this ASAP? It's super important because I need to finish my project that is due on the 31st of this month or maybe next month? Thanks!! Also, I saw some other people having similar issues, so it might be a bigger thing? Let me know if you need more info or if I should just wait? Cheers!", "sender": "jordan.williams@gmail.com"}
{"id": 7, "subject": "Re: Meeting Reschedule - Important!!!", "content": "Hey Team!!! So, like, I was thinking we should maybe, um, reschedule the meeting we were gonna have next next Friday? Or was it the Friday after next? I mean, I guess it could be next week too, but then again, who knows, right? Anyway, let’s just say we need to figure this out ASAP. Also, can we do it in the afternoon? Or was it morning? I can’t remember. Let’s just say I’ll be free, but also busy, you know? So, like, just let me know what works for everyone, or if you have other ideas, I’m open to suggestions, but not too many because that can get confusing. Thanks!!!", "sender": "morgan.smith@gmail.com"}
{"id": 8, "subject": "Bug Report - Urgent or Not? 🤔", "content": "Hey Team, So like, I was using the app and then suddenly it crashed, right? This happened on, um, I think it was last Tuesday or maybe the Tuesday before that? Anyway, it was around 3ish PM, but could've been 4, or was it 2? Not sure. But like, I tried to replicate it again on next next Friday (or was it Thursday??) and it didn’t crash but then it did something weird with the buttons, like they were all jumbled up? So confusing! Can someone look into this? Also, I’m not sure if this is a bug or just my computer being weird, but it’s important. Or maybe not? Let me know what you think. Thanks or sorry for the confusion! Cheers, Alex", "sender": "morgan.williams@tech.io"}
{"id": 6, "subject": "Re: Salary Increase Request", "content": "Hey there, so I was thinking about the thing, you know, like the raise? I mean, it’s been a while since we talked about it, like a few months or maybe it was last year? Anyway, I feel like I’ve been doing a lot of stuff, like that project with the numbers and the other thing with the clients, you know? So, maybe we can discuss it? I was thinking, like, next next Friday or was it the Friday after next? I’m not sure but I’ll be around, unless I’m not, which is possible. Also, I heard from someone that raises are kinda based on performance, but what does that even mean? Like, I perform, right? So, yeah, let me know what you think, or if you want to meet, or if you don’t, or if you just want to ignore this email. Thanks!", "sender": "jordan.jones@tech.io"}
{"id": 9, "subject": "Re: Salary Increase Request", "content": "Hey there, so I was thinking about my pay and like, you know, it’s been a while since we talked about it, like maybe 3 or 4 months? Or was it 5? Anyway, I feel like I’m doing a lot of extra stuff, you know? Like the project last week, or was it the week before? And I mean, next next Friday I have a meeting with the team, and it would be super cool to have this sorted out by then, but also, no rush, right? But also, I think I deserve a raise because I’ve been here for like, forever, and I’m really good at my job, like, really really good. So, can we chat about this? Thanks a bunch!", "sender": "alex.jones@tech.io"}
{"id": 10, "subject": "Request for Raise (or maybe not?)", "content": "Hey Boss, so I was thinking, like, you know how I've been working here for a while now? I mean, it's been, what, like 2 years or something? Anyway, I was wondering if we could talk about, um, my salary? Maybe next next Friday? Or was it last next Friday? I get confused with all these Fridays. Also, I feel like I've been doing a lot of extra stuff, like that project with the thing, you know? And I think I deserve, like, a raise? But also, if not, that's cool too, just thought I’d ask. Let me know what you think, or if you want to chat about it, or not. Thanks! Or, you know, whatever.", "sender": "jordan.smith@corp.net"}
{"id": 13, "subject": "Exciting Product Launch!!!", "content": "Hey Team!!! So, like, we’re launching the new product, right? I mean, it’s super cool and stuff. So, um, I think it’s happening next next Friday, or maybe it’s the Friday after that? Anyway, we need to get all the things done, like the marketing and the, um, you know, the other stuff. Also, don’t forget about the meeting on Tuesday, or was it Wednesday? I’m not sure, but let’s just say it’s important. And, oh, we should probably have snacks too, because who doesn’t love snacks? So, yeah, let’s make this launch the bestest ever!!! Thanks everyone!!!", "sender": "taylor.jones@corp.net"}
{"id": 11, "subject": "Bug Report - Urgent??", "content": "Hey Team, So like, I was using the app and noticed this thing, right? It’s like, when I click on the button that says ‘Submit’ it doesn’t do anything, but sometimes it does?? I mean, it’s really weird. I think it was last week, or maybe the week before, but also could be next next Friday? Anyway, I tried to replicate it and it’s like, sometimes it works, sometimes it doesn’t, you know? Also, I’m not sure if it’s just me or if others have seen this too? Can someone look into it? Thanks, or whatever. Cheers??", "sender": "jordan.brown@gmail.com"}
{"id": 12, "subject": "Exciting Product Launch!!!", "content": "Hey Team!!! So, like, we’re launching the new product, right? I think it’s next next Friday, or maybe it’s this Friday? Anyway, we need to get the marketing stuff ready, like, ASAP. Also, don’t forget about the meeting that’s happening on the 15th, or was it the 16th? I can’t remember. But, like, we should probably have some snacks for that, too. And, oh, the graphics for the launch, they need to be super eye-catching, like, not boring at all. Let’s make it fun!!! Also, I heard from someone that we might have a surprise guest, but I’m not sure who it is. So, yeah, let’s just be ready for anything. Thanks, everyone!!!", "sender": "jordan.brown@tech.io"}
{"id": 14, "subject": "Request for Raise", "content": "Hey Boss, so I was thinking about the thing we talked about last week, you know, the raise? I mean, it’s been like, what, 3 months since we had that convo? Or was it 4? Anyway, I feel like I’ve been doing a lot of extra work, like that project that was due next next Friday, which is actually this Friday but not really because it’s next week but also last week was a blur, right? So, like, if you could maybe consider bumping up my salary, that would be awesome. I mean, I’m not saying I deserve it more than anyone else, but I’ve been here since the beginning of time, or at least since last year, and I think my contributions are worth something, right? Let me know what you think, or if we can chat about it sometime soon, like maybe after lunch or before the meeting that’s not this Tuesday but the one after? Thanks! Cheers!", "sender": "taylor.smith@corp.net"}
{"id": 15, "subject": "Request for Raise or Maybe Not?", "content": "Hey there, so I was thinking, um, about my salary, you know, like how it could be more, or maybe it shouldn't be? I mean, I work hard, right? Like, last week or was it the week before? Anyway, I feel like I deserve a raise, but then again, who doesn't? So, can we chat about this? Maybe next next Friday, or the one after that? I mean, I'm not sure if that's a good time, but it could be. Also, just to clarify, I love my job, but sometimes it feels like I’m doing a lot, like a lot a lot, and I wonder if that’s worth more? Let me know what you think, or don’t, I guess. Thanks, or maybe not? Cheers!", "sender": "morgan.williams@tech.io"}
{"id": 16, "subject": "Bug Report - Urgent or Not?", "content": "Hey Team, so I was using the app and like, I noticed this thing that’s kinda weird, right? It’s like when you click on the button it doesn’t do the thing it’s supposed to do, which is, um, confusing? I think it was last Friday or maybe next next Friday? Not sure, but it was definitely a Friday. Also, I’m not sure if it’s a bug or just me being dumb. Can someone look into it? I mean, it’s not a big deal but also it is? Thanks! Or maybe don’t? Whatever works.", "sender": "morgan.jones@tech.io"}
{"id": 17, "subject": "Re: Meeting Reschedule - Important!!", "content": "Hey Team, so like, I was thinking we should maybe move the meeting that was supposed to be on next next Friday, which is, um, I think the 15th? Or is it the 22nd? Anyway, I mean, we could do it on the following Monday, or possibly even the Tuesday after that, but then again, I heard someone say Wednesday is better for them? So, let's just say we should figure it out, right? Also, can we make sure to have the agenda ready by then? Or not? I dunno. Let me know what works for everyone, or if it doesn't work, then we can just forget about it, I guess? Thanks! Cheers, Alex", "sender": "jordan.brown@gmail.com"}
{"id": 19, "subject": "Meeting Reschedule - Important!!!", "content": "Hey Team, so like, we need to talk about the meeting that was supposed to happen on, um, next next Friday? Or was it this Friday? Anyway, I think we should move it to, like, the 15th or maybe the 22nd? I’m not sure, but it’s super important we figure this out ASAP because, you know, we have to discuss the things and stuff. Also, can everyone make sure to bring their reports? But not the old ones, the new ones, unless the old ones are better? Let me know what works for you all, but I really need an answer by yesterday. Thanks!!!", "sender": "jordan.jones@gmail.com"}
{"id": 18, "subject": "Exciting Launch!!!", "content": "Hey Team!!! So, like, we’re launching the new product, right? I think it’s next next Friday, or maybe the Friday after that?? Anyway, we need to get the marketing stuff ready but also the sales team says they need more time, which is confusing because we thought we were ready? Also, don’t forget about the meeting on Tuesday, or was it Wednesday? I can’t remember, but it’s important!!! Let’s make sure everyone is on the same page, or at least some pages, you know? And the graphics, OMG, they’re not done yet, but they should be, like, super cool when they are. So, yeah, let’s do this and make it awesome, or at least okay. Cheers!", "sender": "morgan.smith@tech.io"}
{"id": 21, "subject": "Meeting Reschedule - Urgent!!", "content": "Hey Team, So, like, we were supposed to meet on, um, next next Friday, right? But I think we should move it to, um, maybe the Tuesday after next? Or was it the Wednesday before that? I mean, I’m not sure if that works for everyone, but I feel like it could be better, you know? Also, if you could let me know if you’re free, that would be great, but also, no pressure! Just trying to figure things out. Thanks! Cheers, -Alex", "sender": "alex.jones@tech.io"}
{"id": 20, "subject": "Re: Salary Increase Request", "content": "Hey Boss, so like, I was thinking about my pay and how it’s been a while since we talked about it, you know? I mean, next next Friday (or was it the one after that?) I’ll have been here for like, um, 3 years? Or maybe it’s 2? Anyway, I feel like I do a lot of stuff, like that project with the thing and the other thing, and I think I deserve a raise, right? But also, I don’t want to seem greedy or anything, just maybe a little more? Like, can we chat about it or something? Maybe we can do it after lunch or before the meeting, or like, whenever you have time. Thanks! Cheers, or whatever.", "sender": "alex.jones@tech.io"}
{"id": 22, "subject": "Meeting Reschedule - Need to Talk ASAP!!", "content": "Hey team, so like, we were supposed to meet on the 15th, right? But I was thinking maybe we could do it next next Friday? Or was it the Friday after next? Anyway, I have a thing that day, but I can do it in the afternoon, or maybe the morning? Just let me know what works for everyone, but also, if you have other plans, I totally get it. Also, can we talk about the agenda? I feel like we need to discuss the things we discussed last time, but also the things we didn't discuss? Confusing, I know! So, yeah, let’s figure it out. Thanks!", "sender": "morgan.brown@corp.net"}
{"id": 23, "subject": "Bug Report - Urgent but not really", "content": "Hey Team, So like, I was using the app and then it crashed. I think it was on the 15th or maybe the 16th of last month? Not sure, but it was a Friday, or was it a Thursday? Anyway, it was really weird because I was trying to do that thing with the buttons, you know, the one that makes the thing happen? So, can we fix it? I mean, I guess it’s not a big deal but it is kind of annoying. Also, can we talk about it next next Friday? Or was it next Thursday? I’m confused. Let me know. Thanks! Or not. Bye!", "sender": "taylor.williams@tech.io"}
{"id": 24, "subject": "Bug Report - Urgent!!!", "content": "Hey Team, So like, I was using the app, right? And then, out of nowhere, it just stopped working. I mean, it was like, last week or maybe the week before? I can't really remember, but it was a Friday, I think? Or was it a Thursday? Anyway, I tried to click on the button that says 'Submit' but it didn't do anything. Like, nothing at all. I even tried refreshing it like, 3 times or maybe 4? And then I thought, maybe if I wait till next next Friday, it would fix itself? But then I realized, what if it’s a bug? So, can someone look into this? I mean, it’s kinda important, right? Thanks, I guess? Let me know if you need more info or if I should just wait till the next next Friday? Cheers!", "sender": "alex.williams@gmail.com"}
{"id": 26, "subject": "Re: Salary Increase Request", "content": "Hey there! So, like, I was thinking about my paycheck, you know, and it seems a bit low, right? I mean, I’ve been here since, um, last year, or was it the year before? Anyway, I do a lot of stuff, like, more than I used to, and I think I deserve a raise, maybe? Can we talk about this? Maybe next next Friday? Or was it this Friday? I get confused with the days sometimes, lol. Also, I know we have that meeting on Tuesday, but I feel like this is important too, right? So, like, if you could let me know what you think, that would be great, but no pressure! Thanks a bunch!", "sender": "alex.brown@corp.net"}
{"id": 25, "subject": "Bug Report - Urgent? Maybe??", "content": "Hey Team, so like, I found this bug, right? It was on the thing we were working on, you know, the project with the colors and stuff. I think it happened last week? Or maybe it was the week before? Anyway, it’s kinda important but also not really? So, like, if you could look at it, that would be great, but no rush? I mean, unless it’s a rush, then it’s a rush. Also, I’m not sure if it’s affecting everyone or just me, but I tried it on my laptop and my phone, and it was weird. Can we discuss this next next Friday? Or was it the Friday after that? I’m confused. Let me know! Thanks, I guess? Cheers!", "sender": "morgan.brown@tech.io"}
{"id": 27, "subject": "Bug Report - Urgent!!!", "content": "Hey team, so like, I was using the app and noticed this weird thing happening, you know? It was like, on the 15th of next next Friday, or maybe it was the 16th? Anyway, the button didn’t work when I clicked it, and then it kinda froze, but then it didn’t? I mean, I think it was after I tried to refresh, but also before I opened the settings? So confusing! Can someone look into this ASAP? I mean, it’s not a big deal, but it kinda is, right? Let me know what you think, or if you need more info, I can try to remember more details, but I’m not sure when that was, maybe last week or next month? Thanks!!!", "sender": "jordan.brown@gmail.com"}
{"id": 28, "subject": "Re: Meeting Reschedule - Important!!!", "content": "Hey Team, so like, I was thinking we should maybe reschedule our meeting that was supposed to happen on next next Friday, or was it the Friday after that? 🤔 Anyway, I have a conflict with my cat's vet appointment or something, and I can't remember if it's at 3 or 4, but we should definitely not do it then. Can we do it like, the week after next week? Or maybe the week after that? Just let me know what works for everyone, but I really need to figure out my schedule first. Also, I think we should discuss the budget, but also the snacks for the meeting, because that's super important too. Thanks! Cheers, Alex", "sender": "taylor.smith@gmail.com"}
{"id": 29, "subject": "Bug Report - Urgent??", "content": "Hey Team, so like, I was using the app and noticed this thing that’s kinda weird?? It happened on, um, I think it was last last Friday or maybe next next Friday? Anyway, the button didn’t work when I clicked it, but sometimes it does?? So, I’m not sure if it’s a bug or just me being silly. Can someone check it out? Also, I’m not sure if it’s the latest version or the one before that, but I think it’s important to fix it ASAP because it’s like, super annoying. Let me know what you think, or if you need more info or whatever. Thanks!!", "sender": "jordan.williams@gmail.com"}
{"id": 30, "subject": "Meeting Reschedule - URGENT!!!", "content": "Hey Team, So, like, we need to talk about the meeting that was supposed to happen on next next Friday, which is, umm, I think the 14th? Or is it the 21st? Anyway, I was thinking we could move it to, like, maybe the Tuesday after that? But also, what about Thursday? I mean, I know some people have plans but we really need to discuss the thing we discussed last time, right? So, let me know if that works or if we should just stick to the original date, which I can't remember right now but it was definitely not last week. Thanks! Cheers, or whatever.", "sender": "morgan.williams@corp.net"}
